[
    {
        "date":"6-9-24",
        "title":"Change Log BABY!!!!!",
        "bullets": [
            "Added tiers to increase content. The first 4 are Stone, Quartz, Copper, and Amethyst.",
            "Added numerous upgrades and miners.",
            "Bigger numbers are now abbriviated."
        ]
    },
    {
        "date":"8-9-24",
        "title":"Topaz Tier",
        "bullets": [
            "Finished the Topaz Tier, which adds a bunch of new upgrades."
        ]
    },
    {
        "date":"9-9-24",
        "title":"UI Changes",
        "bullets": [
            "Made some changes to the UI to make way for pixel art and other UI stuff.",
            "Added a miner count to konw how many miners you've bought.",
            "I got the clicker to rotate, and I'm proud. The clicker is also in the center of the clicking box"
        ]
    },
    {
        "date":"12-9-24",
        "title":"UI Changes",
        "bullets": [
            "I added a temorary background color to the clicking container that represents your tier.",
            "The UI changes on smaller screens so stuff looks better.",
            "I started work on the Aquamarine Tier, or tier 6(I think)."
        ]
    },
    {
        "date":"13-9-24",
        "title":"UI Changes",
        "bullets": [
            "Added a temporary background image instead of a color.",
            "Made a box for the score, cps, and cpc."
        ]
    },
    {
        "date":"16-9-24",
        "title":"Who expected more UI changes!",
        "bullets": [
            "I made the sections on the page(Upgrades, Miners, Tiers) bubbles, or circles. My goal is to make them look like wood boards.",
            "Made the background dark to look somewhat like a cave.",
            "Added a Nav bar. It will be used to access settings, achievements, etc.",
            "Changed the UI in the tier section to look better.",
            "Morgan Wallen is the temporary logo for the game."
        ]
    },
    {
        "date":"17-9-24",
        "title":"Saving and Change Log",
        "bullets": [
            "Added a save system that uses cookies to save your progress every 30 seconds.",
            "Loads your most recent save upon reload.",
            "You can save and load to and from text files.",
            "When the game autosaves, a bubble pops up at the top of the screen.",
            "Added a place to see the change log on the website itself.",
            "Worked on adding content to Aquamarine Tier."
        ]
    },
    {
        "date":"18-9-24",
        "title":"Privacy Policy",
        "bullets": [
            "Added a privacy policy so I don't get destroyed by the law.",
            "Fixed a bug with loading save files from your device.",
            "Added a temporary favicon of Cody Johnson.",
            "The current final tier is Sapphire, which I'll change at some point.",
            "Started to add achievements. There will be a good chunk to get, and will be saved with cookies."
        ]
    },
    {
        "date":"19-9-24",
        "title":"Achievements",
        "bullets": [
            "Added a bunch of new achievements.",
            "Achevments can actually be unlocked now.",
            "Achievements will be part of your savefile now, so they don't go away.",
            "A popup appears when you get an achievement.",
            "Added a button that manually saves the game."
        ]
    },
    {
        "date":"3-10-24",
        "title":"Name Changes",
        "bullets": [
            "Changed the names of some miners and upgrades.",
            "Fixed a bug where the achievements bubble would display multiple achievements at once."
        ]
    },
    {
        "date":"18-10-24",
        "title":"ROCK",
        "bullets": [
            "We got ROCK image!!!!!",
            "Removed the black square.",
            "Added a drop shadow to the clicker."
        ]
    }
]